/*

*/
fn main() {
    let v = std::io::stdin()
        .lines()
        .take(2)
        .map(|x| x.unwrap().trim().parse::<u32>().unwrap())
        .collect::<Vec<_>>();
    if v[0] == 1 {
        println!("Принята монета номинала {}", v[0]);
    } else if v[0] == 2 {
        println!("Принята монета номинала {}", v[0]);
    } else if v[0] == 5 {
        println!("Принята монета номинала {}", v[0]);
    } else if v[0] == 10 {
        println!("Принята монета номинала {}", v[0]);
    } else {
        println!("Монеты такого номинала не принимаются")
    }
    if v[1] == 5 {
        println!("Принята купюра номинала {}", v[1]);
    } else if v[1] == 10 {
        println!("Принята купюра номинала {}", v[1]);
    } else if v[1] == 50 {
        println!("Принята купюра номинала {}", v[1]);
    } else if v[1] == 100 {
        println!("Принята купюра номинала {}", v[1]);
    } else if v[1] == 200 {
        println!("Принята купюра номинала {}", v[1]);
    } else if v[1] == 500 {
        println!("Принята купюра номинала {}", v[1]);
    } else if v[1] == 1000 {
        println!("Принята купюра номинала {}", v[1]);
    } else if v[1] == 2000 {
        println!("Принята купюра номинала {}", v[1]);
    } else if v[1] == 5000 {
        println!("Принята купюра номинала {}", v[1]);
    } else {
        println!("Купюры такого номинала не принимаются")
    }
}
